#pragma once

// Name: Pavlov, Version: 1.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function PavlovProxy.Pavlov_CustomItem.SetPickDisabled
struct APavlov_CustomItem_SetPickDisabled_Params
{
	bool                                               bDisabled;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_CustomItem.OwnerDestroyed
struct APavlov_CustomItem_OwnerDestroyed_Params
{
	class AActor*                                      DestroyedActor;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_CustomItem.OnUsed
struct APavlov_CustomItem_OnUsed_Params
{
	bool                                               bJustPicked;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_CustomItem.OnUse
struct APavlov_CustomItem_OnUse_Params
{
};

// Function PavlovProxy.Pavlov_CustomItem.OnPickup
struct APavlov_CustomItem_OnPickup_Params
{
	class APawn*                                       Pawn;                                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDominant;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PavlovProxy.Pavlov_CustomItem.OnPickDisabled__DelegateSignature
struct APavlov_CustomItem_OnPickDisabled__DelegateSignature_Params
{
	bool                                               bDisabled;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PavlovProxy.Pavlov_CustomItem.OnGetState__DelegateSignature
struct APavlov_CustomItem_OnGetState__DelegateSignature_Params
{
	unsigned char                                      ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PavlovProxy.Pavlov_CustomItem.OnGetPawn__DelegateSignature
struct APavlov_CustomItem_OnGetPawn__DelegateSignature_Params
{
	class APawn*                                       ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PavlovProxy.Pavlov_CustomItem.OnDropItem__DelegateSignature
struct APavlov_CustomItem_OnDropItem__DelegateSignature_Params
{
	bool                                               bDestroy;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_CustomItem.OnDrop
struct APavlov_CustomItem_OnDrop_Params
{
};

// Function PavlovProxy.Pavlov_CustomItem.GetOwningPawn
struct APavlov_CustomItem_GetOwningPawn_Params
{
	class APawn*                                       Pawn;                                                      // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_CustomItem.GetItemState
struct APavlov_CustomItem_GetItemState_Params
{
	PavlovProxy_EProxyItemState                        ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_CustomItem.Drop
struct APavlov_CustomItem_Drop_Params
{
	bool                                               bDestroy;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_CustomItem.CanPickupItem
struct APavlov_CustomItem_CanPickupItem_Params
{
	class APawn*                                       Pawn;                                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.TTTRoundEndSoundEnabled
struct APavlov_GameLogic_TTTRoundEndSoundEnabled_Params
{
	bool                                               bEnabled;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SpawnVehicleAsync
struct APavlov_GameLogic_SpawnVehicleAsync_Params
{
	struct FScriptDelegate                             OnSpawnComplete;                                           // 0x0000(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FName                                       VehicleID;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                                  SpawnTransform;                                            // 0x0000(0x0030)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int                                                TeamId;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DespawnTime;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SpawnVehicle
struct APavlov_GameLogic_SpawnVehicle_Params
{
	struct FName                                       VehicleID;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                                  SpawnTransform;                                            // 0x0000(0x0030)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int                                                TeamId;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                      ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SpawnLootCrateAtTransform
struct APavlov_GameLogic_SpawnLootCrateAtTransform_Params
{
	struct FName                                       LootCrateID;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                                  SpawnTransform;                                            // 0x0000(0x0030)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class AActor*                                      LootCrate;                                                 // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SpawnLootCrate
struct APavlov_GameLogic_SpawnLootCrate_Params
{
	struct FName                                       LootCrateID;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SpawnItemWRef
struct APavlov_GameLogic_SpawnItemWRef_Params
{
	struct FPavlovItemSpawnParams                      Params;                                                    // 0x0000(0x0060)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bSuccessful;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                      Item;                                                      // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SpawnItem
struct APavlov_GameLogic_SpawnItem_Params
{
	struct FPavlovItemSpawnParams                      Params;                                                    // 0x0000(0x0060)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SpawnChicken
struct APavlov_GameLogic_SpawnChicken_Params
{
	struct FTransform                                  SpawnTransform;                                            // 0x0000(0x0030)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class ACharacter*                                  ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SpawnAttachments
struct APavlov_GameLogic_SpawnAttachments_Params
{
	struct FPavlovAttachmentSpawnParams                Params;                                                    // 0x0000(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SpawnAndPosessPawns
struct APavlov_GameLogic_SpawnAndPosessPawns_Params
{
};

// Function PavlovProxy.Pavlov_GameLogic.Spawn
struct APavlov_GameLogic_Spawn_Params
{
	class AController*                                 Controller;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                                  Transform;                                                 // 0x0000(0x0030)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               bAsGhost;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                       Pawn;                                                      // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetZombiesToAutoSpawn
struct APavlov_GameLogic_SetZombiesToAutoSpawn_Params
{
	int                                                TotalZombies;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetZombieAutoSpawnProperties
struct APavlov_GameLogic_SetZombieAutoSpawnProperties_Params
{
	float                                              BatchTimeMin;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BatchTimeMax;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ZBatchSize;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxZCount;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetZBodyCount
struct APavlov_GameLogic_SetZBodyCount_Params
{
	int                                                BodyCount;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetTeamCash
struct APavlov_GameLogic_SetTeamCash_Params
{
	int                                                TeamId;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CashAmmount;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetRoundState
struct APavlov_GameLogic_SetRoundState_Params
{
	PavlovProxy_EPavlovRoundState                      State;                                                     // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetPlayerVitality
struct APavlov_GameLogic_SetPlayerVitality_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Health;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Armour;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Helmet;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetPlayerTeam
struct APavlov_GameLogic_SetPlayerTeam_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TeamId;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetPlayerGag
struct APavlov_GameLogic_SetPlayerGag_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bEnabled;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetPlayerCash
struct APavlov_GameLogic_SetPlayerCash_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CashAmmount;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetPlayerBuyingEnabled
struct APavlov_GameLogic_SetPlayerBuyingEnabled_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Duration;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BuyZoneMaxDistance;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetMovementDisabled
struct APavlov_GameLogic_SetMovementDisabled_Params
{
	bool                                               bDisabled;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetGameModeProperties
struct APavlov_GameLogic_SetGameModeProperties_Params
{
	struct FPavlovGameModeProperties                   Properties;                                                // 0x0000(0x002C)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetFallDamage
struct APavlov_GameLogic_SetFallDamage_Params
{
	bool                                               bEnabled;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetEveryoneCash
struct APavlov_GameLogic_SetEveryoneCash_Params
{
	int                                                CashAmmount;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.SetCashPerZombieKill
struct APavlov_GameLogic_SetCashPerZombieKill_Params
{
	int                                                Cash;                                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.PostRoundCleanUp
struct APavlov_GameLogic_PostRoundCleanUp_Params
{
};

// Function PavlovProxy.Pavlov_GameLogic.OnZombieKilled
struct APavlov_GameLogic_OnZombieKilled_Params
{
	class APlayerState*                                Killer;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACharacter*                                  Zombie;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAutoSpawned;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.OnRoundStateChanged
struct APavlov_GameLogic_OnRoundStateChanged_Params
{
	PavlovProxy_EPavlovRoundState                      OldState;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	PavlovProxy_EPavlovRoundState                      NewState;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.OnRoundEnd
struct APavlov_GameLogic_OnRoundEnd_Params
{
};

// Function PavlovProxy.Pavlov_GameLogic.OnRoundBegin
struct APavlov_GameLogic_OnRoundBegin_Params
{
};

// Function PavlovProxy.Pavlov_GameLogic.OnPlayerSpawned
struct APavlov_GameLogic_OnPlayerSpawned_Params
{
	struct FPavlovPlayerStatus                         PlayerStatus;                                              // 0x0000(0x0050)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.OnPlayerLeftServer
struct APavlov_GameLogic_OnPlayerLeftServer_Params
{
	struct FPavlovPlayerStatus                         PlayerStatus;                                              // 0x0000(0x0050)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.OnPlayerKilled
struct APavlov_GameLogic_OnPlayerKilled_Params
{
	struct FPavlovPlayerStatus                         PlayerStatus;                                              // 0x0000(0x0050)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class APlayerState*                                Killer;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bHeadshot;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       KilledByItem;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.OnPlayerJoinedServer
struct APavlov_GameLogic_OnPlayerJoinedServer_Params
{
	struct FPavlovPlayerStatus                         PlayerStatus;                                              // 0x0000(0x0050)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.OnCustomRconCommand
struct APavlov_GameLogic_OnCustomRconCommand_Params
{
	struct FString                                     RconCommand;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.OnCustomGameModeInit
struct APavlov_GameLogic_OnCustomGameModeInit_Params
{
};

// Function PavlovProxy.Pavlov_GameLogic.OnAssignTeam
struct APavlov_GameLogic_OnAssignTeam_Params
{
	struct FPavlovPlayerStatus                         Status;                                                    // 0x0000(0x0050)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int                                                TeamId;                                                    // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.MulticastOnRoundStateChanged
struct APavlov_GameLogic_MulticastOnRoundStateChanged_Params
{
	bool                                               bStarting;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.ManuallySpawnZombies
struct APavlov_GameLogic_ManuallySpawnZombies_Params
{
	TArray<struct FTransform>                          RandomLocations;                                           // 0x0000(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	int                                                Amount;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bSuccessful;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ACharacter*>                          Zombies;                                                   // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.KillAllZombies
struct APavlov_GameLogic_KillAllZombies_Params
{
};

// Function PavlovProxy.Pavlov_GameLogic.KickPlayer
struct APavlov_GameLogic_KickPlayer_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Reason;                                                    // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bBan;                                                      // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.IncrementTeamScore
struct APavlov_GameLogic_IncrementTeamScore_Params
{
	int                                                TeamId;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Score;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.IncrementPlayerScore
struct APavlov_GameLogic_IncrementPlayerScore_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Score;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.GiveTeamCash
struct APavlov_GameLogic_GiveTeamCash_Params
{
	int                                                TeamId;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CashAmmount;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.GivePlayerCash
struct APavlov_GameLogic_GivePlayerCash_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CashAmmount;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.GiveEveryoneCash
struct APavlov_GameLogic_GiveEveryoneCash_Params
{
	int                                                CashAmmount;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.GetZsToAutoSpawn
struct APavlov_GameLogic_GetZsToAutoSpawn_Params
{
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.GetZAliveCount
struct APavlov_GameLogic_GetZAliveCount_Params
{
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.GetSpawnTransform
struct APavlov_GameLogic_GetSpawnTransform_Params
{
	class AController*                                 Controller;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                                  Transform;                                                 // 0x0000(0x0030)  (Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.GetRoundState
struct APavlov_GameLogic_GetRoundState_Params
{
	PavlovProxy_EPavlovRoundState                      State;                                                     // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.GetPlayerHand
struct APavlov_GameLogic_GetPlayerHand_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDominant;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                      ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.GetPavlovGameModeType
struct APavlov_GameLogic_GetPavlovGameModeType_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	PavlovProxy_EPavlovGameModeType                    ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.GetGameModeProperties
struct APavlov_GameLogic_GetGameModeProperties_Params
{
	struct FPavlovGameModeProperties                   Properties;                                                // 0x0000(0x002C)  (Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GameLogic.EndTTTRound
struct APavlov_GameLogic_EndTTTRound_Params
{
};

// Function PavlovProxy.Pavlov_GameLogic.CleanupZombieBodies
struct APavlov_GameLogic_CleanupZombieBodies_Params
{
};

// Function PavlovProxy.Pavlov_GameLogic.AddZombiesToAutoSpawn
struct APavlov_GameLogic_AddZombiesToAutoSpawn_Params
{
	int                                                Amount;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TotalAmountToSpawn;                                        // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GlobalInfo.SetLimitedAmmoType
struct UPavlov_GlobalInfo_SetLimitedAmmoType_Params
{
	PavlovProxy_ELimitedAmmoType                       AmmoType;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PavlovProxy.Pavlov_GlobalInfo.OnLimitedAmmoModeChanged__DelegateSignature
struct UPavlov_GlobalInfo_OnLimitedAmmoModeChanged__DelegateSignature_Params
{
	PavlovProxy_ELimitedAmmoType                       LimitedAmmoMode;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PavlovProxy.Pavlov_GlobalInfo.OnGetTTTPlayerInfo__DelegateSignature
struct UPavlov_GlobalInfo_OnGetTTTPlayerInfo__DelegateSignature_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTTTPlayerInfo                              ReturnValue;                                               // 0x0000(0x0030)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// DelegateFunction PavlovProxy.Pavlov_GlobalInfo.OnGetLootMesh__DelegateSignature
struct UPavlov_GlobalInfo_OnGetLootMesh__DelegateSignature_Params
{
	struct FAsyncLoadLootMesh                          LoadLootMesh;                                              // 0x0000(0x0018)  (Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PavlovProxy.Pavlov_GlobalInfo.OnGetAllTTTPlayersInfo__DelegateSignature
struct UPavlov_GlobalInfo_OnGetAllTTTPlayersInfo__DelegateSignature_Params
{
	TArray<struct FTTTPlayerInfo>                      ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GlobalInfo.GetTTTPlayerInfo
struct UPavlov_GlobalInfo_GetTTTPlayerInfo_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bSuccessful;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTTTPlayerInfo                              ReturnValue;                                               // 0x0000(0x0030)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GlobalInfo.GetPHTaunts
struct UPavlov_GlobalInfo_GetPHTaunts_Params
{
	class UPavlov_PHTaunts*                            ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GlobalInfo.GetPHTauntAttenuation
struct UPavlov_GlobalInfo_GetPHTauntAttenuation_Params
{
	class USoundAttenuation*                           ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GlobalInfo.GetLootMesh
struct UPavlov_GlobalInfo_GetLootMesh_Params
{
	struct FName                                       LootID;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             OnLootMeshLoaded;                                          // 0x0000(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GlobalInfo.GetLimitedAmmoType
struct UPavlov_GlobalInfo_GetLimitedAmmoType_Params
{
	PavlovProxy_ELimitedAmmoType                       ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GlobalInfo.GetAllTTTPlayersInfo
struct UPavlov_GlobalInfo_GetAllTTTPlayersInfo_Params
{
	TArray<struct FTTTPlayerInfo>                      ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GlobalInfo.DisableVoting
struct UPavlov_GlobalInfo_DisableVoting_Params
{
	bool                                               bDisable;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GlobalInfo.DisableKillfeedBeep
struct UPavlov_GlobalInfo_DisableKillfeedBeep_Params
{
	bool                                               bDisable;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GlobalInfo.DisableAttachmentMode
struct UPavlov_GlobalInfo_DisableAttachmentMode_Params
{
	bool                                               bDisable;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_GlobalInfo.AddItemToList
struct UPavlov_GlobalInfo_AddItemToList_Params
{
	struct FItemList                                   Item;                                                      // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_HandProxy.TriggerDown
struct UPavlov_HandProxy_TriggerDown_Params
{
};

// Function PavlovProxy.Pavlov_HandProxy.ReplicateInteract_Server
struct UPavlov_HandProxy_ReplicateInteract_Server_Params
{
	PavlovProxy_EInteractType                          InteractType;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                     InteractObj;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_HandProxy.Grab
struct UPavlov_HandProxy_Grab_Params
{
};

// Function PavlovProxy.Pavlov_HandProxy.GetPlayerProxy
struct UPavlov_HandProxy_GetPlayerProxy_Params
{
	class APavlov_PlayerProxy*                         ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_HandProxy.GetOverlappingInteractInterface
struct UPavlov_HandProxy_GetOverlappingInteractInterface_Params
{
	class UObject*                                     ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_InteractBox.InteractServer
struct UPavlov_InteractBox_InteractServer_Params
{
	PavlovProxy_EInteractType                          InteractType;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPavlov_HandProxy*                           HandProxy;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                     InteractObj;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_InteractBox.InteractClient
struct UPavlov_InteractBox_InteractClient_Params
{
	PavlovProxy_EInteractType                          InteractType;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPavlov_HandProxy*                           HandProxy;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                     InteractObj;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_InteractInterface.InteractServer
struct UPavlov_InteractInterface_InteractServer_Params
{
	PavlovProxy_EInteractType                          InteractType;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPavlov_HandProxy*                           HandProxy;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                     InteractObj;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_InteractInterface.InteractClient
struct UPavlov_InteractInterface_InteractClient_Params
{
	PavlovProxy_EInteractType                          InteractType;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPavlov_HandProxy*                           HandProxy;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                     InteractObj;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_InteractSkeletalMesh.InteractServer
struct UPavlov_InteractSkeletalMesh_InteractServer_Params
{
	PavlovProxy_EInteractType                          InteractType;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPavlov_HandProxy*                           HandProxy;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                     InteractObj;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_InteractSkeletalMesh.InteractClient
struct UPavlov_InteractSkeletalMesh_InteractClient_Params
{
	PavlovProxy_EInteractType                          InteractType;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPavlov_HandProxy*                           HandProxy;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                     InteractObj;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_InteractStaticMesh.InteractServer
struct UPavlov_InteractStaticMesh_InteractServer_Params
{
	PavlovProxy_EInteractType                          InteractType;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPavlov_HandProxy*                           HandProxy;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                     InteractObj;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_InteractStaticMesh.InteractClient
struct UPavlov_InteractStaticMesh_InteractClient_Params
{
	PavlovProxy_EInteractType                          InteractType;                                              // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPavlov_HandProxy*                           HandProxy;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                     InteractObj;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_Library.SendMsg
struct UPavlov_Library_SendMsg_Params
{
	struct FMessage                                    Msg;                                                       // 0x0000(0x0028)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_Library.SendAllMsg
struct UPavlov_Library_SendAllMsg_Params
{
	struct FMessage                                    Msg;                                                       // 0x0000(0x0028)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_Library.SaveStringToFile
struct UPavlov_Library_SaveStringToFile_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     String;                                                    // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Filename;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAllowOverwrite;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_Library.SaveStringArray
struct UPavlov_Library_SaveStringArray_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             SaveArray;                                                 // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FString                                     Filename;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               AllowOverwrite;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_Library.LogToConsole
struct UPavlov_Library_LogToConsole_Params
{
	struct FString                                     LogMsg;                                                    // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bError;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_Library.LoadStringFromFile
struct UPavlov_Library_LoadStringFromFile_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     String;                                                    // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Filename;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_Library.LoadStringArray
struct UPavlov_Library_LoadStringArray_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             Strings;                                                   // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FString                                     Filename;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_Library.IsCommunityServer
struct UPavlov_Library_IsCommunityServer_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_Library.HasPlayerProxy
struct UPavlov_Library_HasPlayerProxy_Params
{
	class APawn*                                       Pawn;                                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_Library.HasPlayerInfo
struct UPavlov_Library_HasPlayerInfo_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_Library.HasMsgHandler
struct UPavlov_Library_HasMsgHandler_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_Library.GetWhitelist
struct UPavlov_Library_GetWhitelist_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bSuccessful;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             Whitelist;                                                 // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function PavlovProxy.Pavlov_Library.GetPlayerProxy
struct UPavlov_Library_GetPlayerProxy_Params
{
	class APawn*                                       Pawn;                                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APavlov_PlayerProxy*                         ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

